# -*- coding: utf-8 -*-
from databases import mysql_common

import numpy as np
import matplotlib.pyplot as plt
import config.mysql_config


def money_distribute():
    category = {'319': '快照冲印', '327': '其他美食', '338': '温泉洗浴', '341': 'KTV', '345': '电影', '347': '足疗按摩', '349': '文化艺术',
                '351': '母婴玩具', '353': '服装/内衣', '354': '手表饰品', '355': '运动户外', '356': '个护化妆', '357': '家居家纺',
                '360': '图书杂志', '364': '火锅', '367': '宠物服务', '375': '教育培训', '380': '小吃快餐', '388': '粤菜', '389': '日本料理',
                '390': '东南亚菜', '391': '西餐', '392': '自助餐', '393': '川菜', '397': '数码家电', '403': '鞋/箱包', '423': '酒吧',
                '424': '江浙菜', '428': '儿童摄影', '439': '海鲜', '450': '北京菜', '451': '新疆/清真菜', '454': '湖北菜', '459': '口腔',
                '460': '烧烤/烤肉', '471': '茶室', '474': '咖啡厅', '488': '湘菜', '501': '韩国料理', '504': '东北菜', '509': '云南菜',
                '528': '其他', '540': '其他生活服务', '544': '其他', '556': '美甲', '565': '婚纱摄影', '614': '个性写真', '616': '加油站',
                '642': '酒店', '646': '美发', '652': '鲁菜', '653': '西北菜', '654': '贵州菜', '655': '素食', '670': '体检',
                '675': '食品保健', '682': '0元', '683': '抽奖', '684': '其他', '688': '景点郊游', '689': '蛋糕甜品', '690': '干锅/香锅',
                '691': '聚会宴请', '692': '创意菜/私房菜', '693': '江西菜', '694': '内蒙菜', '695': '客家菜', '696': '台湾菜', '697': '天津菜',
                '698': '游乐游艺', '699': '运动健身', '700': '采摘', '701': '演出赛事', '702': '亲子', '703': '配镜', '704': '服装定制',
                '705': '洗衣店', '706': '汽车养护', '707': '美容SPA', '708': '旅游', '709': '婚庆服务', '801': '休闲零食', '802': '酒水冲调',
                '803': '保健品', '804': '礼券/其他', '805': '女装', '806': '男装', '810': '其他', '811': '饰品', '812': '眼镜',
                '813': '手表', '817': '其他', '818': '面部护肤', '820': '彩妆香水', '821': '男士', '822': '其他', '823': '居家日用',
                '825': '厨房餐饮', '826': '家纺', '827': '家具家饰', '829': '其他', '832': '户外/旅行', '833': '玩具/早教', '834': '其他',
                '835': '其他', '836': '其他', '839': '其他', '840': '数码及配件', '841': '小家电', '842': '健康护理', '843': '办公/文具',
                '844': '其他', '848': '其他', '851': '图书', '852': '音像', '853': '粮油干货', '854': '内衣/袜品', '855': '服饰配件',
                '856': '珠宝黄金', '857': '礼品', '858': '个人护理', '859': '宠物', '860': '女鞋', '861': '男鞋', '862': '拖鞋',
                '863': '箱包', '864': '皮具', '865': '运动鞋服', '866': '运动用品', '867': '汽车', '868': '童装童鞋', '869': '孕婴幼食品',
                '870': '孕婴幼用品', '871': '杂志', '872': '美容工具', '873': '时尚女包', '874': '徽菜', '875': '本地购物', '876': '中东菜',
                '877': '披萨', '878': '烤鱼', '879': '辣味美食', '880': '甜点饮品', '881': '蛋糕', '882': '其他异国餐饮', '883': '烤鸭',
                '884': '麻辣烫', '885': '山西菜', '886': '海南菜', '887': '闽菜', '888': '河南菜', '889': '河北菜', '890': '其他中餐',
                '891': '4D/5D电影', '892': '展览', '893': '话剧', '894': '相声', '895': '桌游', '896': '电玩/游戏币', '897': 'DIY手工',
                '898': '密室逃脱', '899': '真人CS', '900': '卡丁车', '901': '其他娱乐活动', '902': '篮球', '903': '足球', '904': '羽毛球',
                '905': '乒乓球', '906': '网球', '907': '台球', '908': '保龄球', '909': '高尔夫', '910': '射箭/射击', '911': '游泳',
                '912': '瑜伽', '913': '舞蹈', '914': '滑雪/滑冰', '915': '攀岩', '916': '骑马', '917': '武术/搏击', '918': '其他运动',
                '919': '其他养生保健', '920': '游乐园/水上乐园', '921': '健身房', '922': '录音棚', '923': '证件照', '924': '照片冲印',
                '925': '化妆', '926': '其他丽人', '927': '家政服务', '928': '驾校/陪练', '929': '租车', '930': '鲜花', '931': '充值服务',
                '932': '送水/送奶', '934': '经济型酒店', '935': '豪华酒店', '936': '公寓式酒店', '937': '商务酒店', '938': '快捷酒店',
                '939': '主题酒店', '940': '青年旅舍', '941': '度假酒店', '942': '农家院', '943': '钟点房', '944': '五星', '945': '四星',
                '946': '三星', '947': '国内游', '948': '境外游', '949': '赛车', '951': '美甲', '952': '美足', '953': '美睫',
                '954': '洗衣', '955': '洗车', '958': '手机维修', '961': '演唱会', '962': '音乐会', '963': '话剧舞台剧', '964': '舞蹈芭蕾',
                '965': '戏曲综艺', '966': '体育赛事', '967': '休闲娱乐', '968': '周边商品', '969': '儿童亲子', '981': '手机充值', '991': '代驾',
                '1001': '二手车', '1002': '维修保养', '1003': '交通违章', '1004': '舒适型酒店', '1005': '销售网点', '1006': '特色街区',
                '1007': '网吧', '1008': '数码产品', '1009': '书店', '1010': '美睫', '1011': '4S汽车销售', '1012': '家居家具',
                '1013': '产护', '1014': '服饰鞋包', '1015': '养生', '1016': '医院', '1017': '孕用产品', '1018': '运动户外', '1019': '装修',
                '1020': '本帮菜', '1021': '潮汕菜', '1022': '茶餐厅', '1023': '福州菜', '1024': '赣菜', '1025': '广西菜', '1026': '湖北菜',
                '1027': '湖鲜', '1028': '淮扬菜', '1029': '冀菜', '1030': '江湖菜', '1031': '江鲜', '1032': '鲁菜', '1033': '南京菜',
                '1034': '宁波菜', '1035': '陕菜', '1036': '上海菜', '1037': '泰国菜', '1038': '无锡菜', '1039': '豫菜', '1040': '新加坡菜',
                '1041': '云贵菜', '1042': '湛江菜', '1043': '地中海菜', '1044': '杭帮菜', '1045': '绍兴菜', '1046': '客栈民宿',
                '1047': '珠宝', '2000': '药店', '2001': '药品', '2002': '保健品', '2003': '医疗器械', '2004': '药品相关', '2005': '租房',
                '2006': '酒店自助餐', '2007': '一日游', '2008': '旅拍婚纱', '2009': '园区', '2010': '公司企业', '2011': '农林园艺',
                '2012': '厂矿', '2013': '美瞳', '2014': '婚纱礼服', '2015': '珠宝首饰', '2016': '婚宴', '2017': '绿植', '2018': '皮具护理',
                '2019': '手机电脑维修', '2020': '家电维修', '2021': '开锁', '2022': '疏通管道', '2023': '新车', '2024': '轰趴馆',
                '2025': '家装设计', '2026': '装修监理', '2027': '装修服务', '2028': '全屋定制', '2029': '建材家居', '2030': '搬家服务',
                '2031': '维修保养', '2032': '汽车美容', '2033': '汽车配件', '2034': 'QQ和游戏充值', '2035': '加油卡充值', '2036': '固话宽带充值',
                '2037': '标准建材', '2038': '定制家具', '2039': '闪送超市', '2040': '房产租赁', '2041': '房产买卖', '2042': '川菜',
                '2043': '自贡盐帮菜', '2044': '江浙菜', '2045': '浙江菜', '2046': '江苏菜', '2047': '上海菜', '2048': '粤菜',
                '2049': '燕翅鲍', '2050': '茶餐厅', '2051': '北京菜', '2052': '烤鸭', '2053': '徽菜', '2054': '臭鳜鱼', '2055': '东北菜',
                '2056': '灶台鱼', '2057': '西北菜', '2058': '甘肃菜', '2059': '陕西菜', '2060': '青海菜', '2061': '创意菜', '2062': '家常菜',
                '2063': '农家菜', '2064': '官府菜', '2065': '西餐', '2066': '比萨-披萨', '2067': '牛排', '2068': '法国菜', '2069': '英国菜',
                '2070': '美国菜', '2071': '俄罗斯菜', '2072': '意大利菜', '2073': '西班牙菜', '2074': '日本料理', '2075': '寿司',
                '2076': '拉面', '2077': '日式烧烤', '2078': '日式火锅', '2079': '东南亚菜', '2080': '泰国菜', '2081': '越南菜',
                '2082': '印度菜', '2083': '海鲜', '2084': '龙虾', '2085': '江河湖鲜', '2086': '干锅', '2087': '香锅', '2088': '香辣蟹/虾',
                '2089': '自助餐', '2090': '烤肉自助', '2091': '火锅自助', '2092': '海鲜自助', '2093': '西餐自助', '2094': '甜品自助',
                '2095': '日式自助', '2096': '酒店自助', '2097': '火锅', '2098': '焖锅', '2099': '川渝火锅', '2100': '串串香',
                '2101': '北京火锅', '2102': '粤式火锅', '2103': '豆捞', '2104': '韩式火锅', '2105': '云南火锅', '2106': '鱼火锅',
                '2107': '海鲜火锅', '2108': '羊蝎子火锅', '2109': '小火锅-单人火锅', '2110': '烤肉', '2111': '烧烤', '2112': '烤全羊',
                '2113': '海鲜烧烤', '2114': '韩式烤肉', '2115': '西式烧烤', '2116': '小吃快餐', '2117': '饺子', '2118': '包子',
                '2119': '馄饨', '2120': '面', '2121': '米线/米粉', '2122': '中式快餐', '2123': '西式快餐', '2124': '日韩快餐',
                '2125': '熟食', '2126': '零食', '2127': '粥店', '2128': '冒菜', '2129': '麻辣烫', '2130': '小龙虾', '2131': '地方小吃',
                '2132': '蛋糕', '2133': '生日蛋糕', '2134': '婚庆蛋糕', '2135': '甜点', '2136': '饮品', '2137': '面包', '2138': '港台甜品',
                '2139': '奶茶', '2140': '果汁', '2141': '下午茶', '2142': '冰淇淋', '2149': '结婚行业', '2150': '汽车美容',
                '2151': '驾校/陪练', '2152': '租车', '2153': '新车服务', '2154': '汽车配件', '2155': '维修保养', '2156': '汽车加油',
                '2157': '代驾', '2158': '道路救援', '2159': '留学', '2160': '升学服务', '2161': '职业培训', '2162': '幼儿教育',
                '2163': '生活兴趣培训', '2164': '外语培训', '2165': '更多教育分类', '2166': '高端儿科', '2167': '高端一站式', '2168': '母婴护理',
                '2169': '亲子购物', '2170': '亲子派对', '2171': '亲子摄影', '2172': '亲子娱乐', '2173': '月子', '2174': '医药行业',
                '2175': '宠物行业', '2176': '到家服务', '2177': '维修行业', '2178': '清洗护理', '2179': '家装行业', '2180': '丽人行业',
                '2181': '搬家服务', '2182': '社区物业', '2183': '照片服务', '2184': '网吧网咖', '2185': 'VR体验', '2186': '玩酷项目',
                '2187': '文化艺术', '2188': '汗蒸', '2189': '球类', '2190': '路跑', '2191': '骑行', '2192': '滑雪', '2193': '滑冰',
                '2194': '洗浴', '2195': '温泉', '2196': '游船', '2197': '漂流', '2198': '旅游服务', '2199': '邮轮', '2200': '婚纱摄影',
                '2201': '婚宴', '2202': '婚纱礼服', '2203': '婚庆服务', '2204': '一站式婚礼', '2205': '男士礼服', '2206': '司仪主持',
                '2207': '婚车租赁', '2208': '婚礼跟拍', '2209': '婚礼甜品', '2210': '婚礼花艺', '2211': '结婚用品', '2212': '珠宝首饰',
                '2213': '洗车', '2214': '镀晶封釉', '2215': '贴膜', '2216': '打蜡', '2217': '内饰清洗', '2218': '其他美容',
                '2219': '驾校服务', '2220': '汽车陪练', '2221': '短期租车', '2222': '长期租车', '2223': '试驾', '2224': '整车销售',
                '2225': '内外饰品', '2226': '原厂配件', '2227': '配件安装', '2228': '改装配件', '2229': '汽车保养', '2230': '汽车维修',
                '2231': '钣金', '2232': '喷漆', '2233': '综合检修', '2234': '雅思', '2235': '托福', '2236': 'SAT', '2237': 'GRE',
                '2238': 'GMAT', '2239': '留学服务', '2240': '其他', '2241': '小学', '2242': '初中', '2243': '高中', '2244': '考研',
                '2245': '其他', '2246': 'IT类', '2247': '烹饪', '2248': '美容美发', '2249': '服装设计', '2250': '建筑类', '2251': '财会类',
                '2252': '公务员', '2253': '司法类', '2254': '医疗类', '2255': '金融类', '2256': '其他职业培训', '2257': '胎教',
                '2258': '大脑开发', '2259': '感觉统合', '2260': '亲子课程', '2261': '思维训练', '2262': '体能开发', '2263': '婴儿游泳',
                '2264': '其他早教', '2265': '乐高', '2266': '少儿钢琴培训', '2267': '少儿国学', '2268': '少儿乐器演奏', '2269': '少儿轮滑',
                '2270': '少儿美术', '2271': '少儿声乐', '2272': '少儿书法', '2273': '少儿舞蹈', '2274': '少儿游泳', '2275': '托班/托儿所',
                '2276': '学能评测', '2277': '幼儿英语', '2278': '幼小衔接', '2279': '其他音乐', '2280': '钢琴', '2281': '吉他',
                '2282': '小提琴', '2283': '古筝', '2284': '声乐', '2285': '架子鼓', '2286': '美术', '2287': '书法', '2288': '舞蹈',
                '2289': '瑜伽', '2290': '游泳', '2291': '健身', '2292': 'DIY', '2293': '烘焙', '2294': '其他兴趣培训', '2295': '英语',
                '2296': '日语', '2297': '德语', '2298': '韩语', '2299': '法语', '2300': '汉语', '2301': '西班牙语', '2302': '小语种',
                '2303': '视力矫正', '2304': '小儿推拿/小儿按摩', '2305': '婴儿理发', '2306': '孕妇美容', '2307': '宝宝用品', '2308': '儿童服饰',
                '2309': '亲子用品', '2310': '玩具', '2311': '孕产用品', '2312': '宝宝宴', '2313': '诞生礼/纪念品定制', '2314': '亲子派对策划',
                '2315': '儿童摄影', '2316': '亲子照', '2317': '全家福', '2318': '上门拍', '2319': '孕妇写真', '2320': '冬夏令营',
                '2321': '儿童演出展览', '2322': '儿童职业体验', '2323': '儿童主题乐园', '2324': '绘本馆', '2325': '科学博物', '2326': '亲子DIY',
                '2327': '亲子采摘/农家乐', '2328': '亲子乐园', '2329': '亲子旅游', '2330': '亲子运动探险', '2331': '服装鞋包', '2332': '化妆品',
                '2333': '数码家电', '2334': '烟酒茶叶', '2335': '运动户外', '2336': '图书音像', '2337': '杂货礼品', '2338': '乐器',
                '2339': '购物中心', '2340': '超市便利', '2341': '批发商城', '2342': '其他购物', '2343': '鲜花', '2344': '绿植',
                '2345': '配镜', '2346': '口腔', '2347': '体检', '2348': '药品相关', '2349': '医疗机械', '2350': '保健品', '2351': '药品',
                '2352': '其他数码维修', '2353': '其他家电维修', '2354': '管道疏通', '2355': '开锁/修锁', '2356': '电脑维修', '2357': '手机维修',
                '2358': '空调维修', '2359': '冰箱维修', '2360': '洗衣机维修', '2361': '家具维修', '2362': '房屋维修', '2363': '洗衣',
                '2364': '洗鞋', '2365': '衣服熨烫', '2366': '皮衣护理', '2367': '皮包护理', '2368': '皮质家具护理', '2369': '家装设计',
                '2370': '建筑材料', '2371': '家具家纺', '2372': '厨房卫浴', '2373': '美甲', '2374': '美发', '2375': '美容SPA',
                '2376': '化妆', '2377': '美睫', '2378': '美足', '2379': '其他丽人', '2380': '医疗美容', '2381': '物业费', '2382': '停车费',
                '2383': '个性写真', '2384': '照片冲印', '2385': '证件照', '2386': 'DIY台历', '2387': '海报制作', '2388': '网吧网咖',
                '2389': '电竞馆', '2390': '桌游', '2391': '棋牌室', '2392': '动漫/玩具店', '2393': '主题休闲吧', '2394': 'DIY手工',
                '2395': '画室画廊', '2396': '录音棚/琴行', '2397': '展览', '2398': '话剧', '2399': '演出赛事', '2400': '相声',
                '2401': '其它文化', '2402': '台球', '2403': '篮球', '2404': '高尔夫', '2405': '保龄球', '2406': '网球', '2407': '乒乓球',
                '2408': '羽毛球', '2409': '足球', '2410': '游乐园/主题乐园', '2411': '水上乐园', '2412': '海洋馆', '2413': '动植物园',
                '2414': '健身房', '2415': '私教工作室', '2416': '国内一日游', '2417': '国内景酒', '2418': '国内自由行', '2419': '国内跟团游',
                '2420': '境外门票', '2421': '境外玩乐', '2422': '境外一日游', '2423': '境外景酒', '2424': '境外自由行', '2425': '境外跟团游',
                '2426': '境外美食', '2427': '境外购物', '2428': '境外交通', '2429': '境外用车', '2430': '境外导游', '2431': '境外优惠券',
                '2432': '境外定制游', '2433': '游学', '2434': '旅游签证', '2435': '旅游WIFI', '2436': '宠物狗', '2437': '宠物猫',
                '2438': '花鸟鱼虫', '2439': '宠物食品用品', '2440': '其他宠物服务', '2441': '宠物店服务', '2442': '互动影院', '2443': '私人影院',
                '2444': '月子服务', '2445': '孕妇瑜伽', '2446': '母婴体检', '2447': '其他母婴服务', '2448': '其他幼儿教育', '2449': '学能测评',
                '2450': '其他少儿运动', '2451': '少儿围棋', '2452': '少儿陶艺', '2453': '情商培训', '2454': '其他少儿才艺', '2455': '四维彩超',
                '2456': '妇幼医院', '2457': '产后恢复', '2458': '满月汗蒸', '2459': '开奶催乳', '2460': '月子中心', '2461': '月子服务',
                '2462': '月子餐', '2463': '月嫂', '2464': '美瞳', '2465': '家政保洁', '2466': '保姆', '2467': '送奶送水', '2468': '送蛋糕',
                '2469': '生鲜闪送', '2470': '上门美容', '2471': '送药', '2472': '居民搬家', '2473': '企业搬家', '2474': '小型搬家',
                '2475': '大件搬运', '2476': '空调移机', '2477': '搬家综合', '2478': '住宅小区'}

    para_dict = config.mysql_config.get_config("../file/mysql_dp.conf")

    mysql = mysql_common.MysqlCommon(para_dict['host'], para_dict['port'], para_dict['user'], para_dict['pwd'],
                                     para_dict['db'])
    for cate, name in category.items():
        sql = "select cast((current_price/10000) as int) as money,sum(buy_count) as total from " \
              "dp_deal_detail_performance_day_v1 " \
              "where loaddate>=20160801 and category_id_2=" + cate + " and sale_city_name='北京市' " \
                                                                    "group by money ORDER BY money asc  limit 50;"
        results = mysql.fetch_data(sql)

        dict = {}

        for result in results:
            dict[result[0]] = result[1]
        for i, key in enumerate(dict):  # Circulate both index and value(Here is key)
            plt.bar(i, dict[key], color='r', width=0.2)
        plt.xticks(np.arange(len(dict)) + 0.1, dict.keys())  # Translation
        plt.yticks(dict.values())
        plt.grid(True)
        fig = plt.gcf()
        fig.set_size_inches(18.5, 10.5)
        fig.savefig('d:\\del\\pic\\' + name.decode("utf-8").replace("/", "") + '.png', dpi=100)
        fig.clear()


if "__main__" == __name__:
    money_distribute()
